[     
    {
      "title": "Ballad Of Songbirds And Snakes",
      "author": "Suzanne Collins",
      "wikiLink": "https://www.goodreads.com/book/show/51901147-the-ballad-of-songbirds-and-snakes",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/f/f1/The_Ballad_of_Songbirds_and_Snakes_%28Suzanne_Collins%29.png",
      "altText": "Green cover with a gold bird and snake intertwined on a branch",
      "text": "Set 64 years before the Hunger Games trilogy, this prequel follows a young Coriolanus Snow as he mentors a tribute in the 10th Hunger Games, exploring his early path to power and the origins of the games.",
      "genre": "Fiction",
      "format": "Physical",
      "dateRead": "2025-01-12"
    },

    {
      "title": "Sunrise On the Reaping",
      "author": "Suzanne Collins",
      "wikiLink": "https://www.goodreads.com/book/show/214331246-sunrise-on-the-reaping?ref=nav_sb_ss_1_22",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/2/20/Sunrise_on_the_Reaping_book_cover.jpg",
      "altText": "Purple background with white text with a gold snake and bird converging",
      "text": "Sunrise on the Reaping explores the 50th Hunger Games, providing deeper insight into Haymitch Abernathy's character and the political complexities of Panem during that era.",
      "genre": "Fiction",
      "format": "Physical",
      "dateRead": "2025-05-3"
    },

    {
      "title": "Dune",
      "author": "Frank Herbert",
      "wikiLink": "https://www.goodreads.com/book/show/44767458-dune?from_search=true&from_srp=true&qid=hUBFSeR8C6&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/d/de/Dune-Frank_Herbert_%281965%29_First_edition.jpg",
      "altText": "faded brown mountains with a blue sky near the top with title written in a fancy white text",
      "text": "set in a far-future interstellar empire where noble houses vie for control of the desert planet Arrakis—the only source of the powerful spice melange. The story follows young Paul Atreides, heir to House Atreides, as his family is betrayed and he is thrust into exile among the native Fremen. As he adapts to the harsh desert environment, Paul discovers his destiny may be far greater than political revenge",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-04-28"
    },

    {
      "title": "Dune Messiah",
      "author": "Frank Herbert",
      "wikiLink": "https://www.goodreads.com/book/show/44492285-dune-messiah?from_search=true&from_srp=true&qid=qaxgP4AiqQ&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/4/46/Dune_Messiah-Frank_Herbert_%281969%29_First_edition.jpg",
      "altText": "reddish orange background with a skull in the center and white text displayed above with the title",
      "text": "set twelve years after the events of Dune. Paul Atreides, now Emperor of the known universe, struggles with the consequences of the jihad waged in his name. As political conspiracies threaten his reign, Paul faces moral dilemmas, prophetic burdens, and the limits of prescience. The novel explores themes of power, religion, and the cost of destiny as Paul begins to understand the price of being a messianic figure",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-05-5"
    },

    {
      "title": "Fourth Wing",
      "author": "Rebecca Yarros",
      "wikiLink": "https://www.goodreads.com/book/show/61431922-fourth-wing?ref=nav_sb_ss_1_11",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/d/dd/Fourth_Wing_Cover_Art.jpeg",
      "altText": "Yellow to orange gradient with a black circle and a bird on top of it. ",
      "text": "Follows Violet Sorrengail, a young woman who is unexpectedly forced to join a brutal war college for dragon riders, known as Basgiath War College. Though physically fragile and more suited to a scholarly life, Violet must endure deadly training, form bonds with dragons, and navigate dangerous political intrigue. The story blends romance, action, and high-stakes fantasy, and has been praised for its strong female lead, fast-paced plot, and emotional depth.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-02-25"
    },

    {
      "title": "Iron Flame",
      "author": "Rebecca Yarros",
      "wikiLink": "https://www.goodreads.com/book/show/90202302-iron-flame?ref=nav_sb_ss_1_4",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/1/10/Iron_Flame_Cover_Art.jpg",
      "altText": "Orange to black gradient with a black circle thats being engulfed by flames",
      "text": " series. It continues the story of Violet Sorrengail as she returns to Basgiath War College after surviving the deadly first year and uncovering shocking secrets about her kingdom and the rebellion. In Iron Flame, Violet faces even harsher trials, growing powers, and deeper betrayals—all while her bond with her dragons and her complicated relationship with Xaden Riorson are tested.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-03-15"
    },

    {
      "title": "A Game of Thrones",
      "author": "George R. R. Martin",
      "wikiLink": "https://www.goodreads.com/book/show/13496.A_Game_of_Thrones?ref=nav_sb_ss_1_13",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/9/93/AGameOfThrones.jpg",
      "altText": "Faded yellow and orange text with a lion depicted in the middle",
      "text": "The story follows several noble families—chief among them the Starks, Lannisters, and Targaryens—as they scheme, battle, and form uneasy alliances in their pursuit of power and the Iron Throne. At the heart of the novel is Eddard Stark, a noble and honorable lord who is thrust into the dangerous politics of the royal court when he becomes the King’s Hand. As tensions rise across the realm, ancient supernatural forces begin to stir in the far North beyond the Wall, threatening all of humanity. With its sprawling cast, moral complexity, and dramatic twists, A Game of Thrones lays the foundation for a gripping tale of loyalty, betrayal, and the high cost of power.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-01-16"
    },

    {
      "title": "A Clash of Kings",
      "author": "George R. R. Martin",
      "wikiLink": "https://www.goodreads.com/book/show/10572.A_Clash_of_Kings?from_search=true&from_srp=true&qid=vfTA1O0C2G&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/3/39/AClashOfKings.jpg",
      "altText": "Faded yellow and orange background with a gold crown depicted in the center",
      "text": "Continuing the sweeping saga of political ambition, war, and supernatural threat in the Seven Kingdoms of Westeros. Following the death of King Robert Baratheon, the realm descends into chaos as five kings—Stannis and Renly Baratheon, Robb Stark, Balon Greyjoy, and the boy-king Joffrey Baratheon—vie for the Iron Throne or independence. As civil war erupts across the land, power shifts rapidly, alliances are tested, and betrayal is rampant. Meanwhile, far to the east, Daenerys Targaryen struggles to find allies and strength for her claim to the throne, while in the North, Jon Snow ventures beyond the Wall with the Night’s Watch and discovers ancient, dark forces awakening. A Clash of Kings deepens the complexity of the series with new characters, larger battles, and a growing sense that magic—and danger—is returning to the world.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-01-30"
    },

    {
      "title": "A Psalm for the Wild-Built",
      "author": "Becky Chambers",
      "wikiLink": "https://www.goodreads.com/book/show/40864002-a-psalm-for-the-wild-built?ref=nav_sb_ss_5_4",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/a/a5/PsalmforWild.jpg",
      "altText": "Green flowers with a brown dirt road going across the page with a robot and monk on carriage on the path ",
      "text": "Set in a hopeful, post-industrial future on the moon Panga, the story follows Dex, a tea monk searching for deeper meaning in life, who unexpectedly meets Mosscap, a sentient robot. Robots in this world gained consciousness centuries ago and peacefully left human society, venturing into the wilderness. Mosscap returns with a simple but profound question: What do people need?",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-02-05"
    },

    {
      "title": "The Love Hypthesis ",
      "author": "Ali Hazelwood",
      "wikiLink": "https://www.goodreads.com/book/show/56732449-the-love-hypothesis?from_search=true&from_srp=true&qid=Kwulqjmnn8&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/f/f3/The_Love_Hypothesis.jpg",
      "altText": "",
      "text": "",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-05-5"
    },

    {
      "title": "",
      "author": "",
      "wikiLink": "",
      "imageUrl": "",
      "altText": "",
      "text": "",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-05-5"
    },

    {
      "title": "",
      "author": "",
      "wikiLink": "",
      "imageUrl": "",
      "altText": "",
      "text": "",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-05-5"
    }
    
  ]
 
 

