[     
    {
      "title": "Ballad Of Songbirds And Snakes",
      "author": "Suzanne Collins",
      "wikiLink": "https://www.goodreads.com/book/show/51901147-the-ballad-of-songbirds-and-snakes",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/f/f1/The_Ballad_of_Songbirds_and_Snakes_%28Suzanne_Collins%29.png",
      "altText": "Green cover with a gold bird and snake intertwined on a branch",
      "text": "Set 64 years before the Hunger Games trilogy, this prequel follows a young Coriolanus Snow as he mentors a tribute in the 10th Hunger Games, exploring his early path to power and the origins of the games.",
      "genre": "Fiction",
      "format": "Physical",
      "dateRead": "2025-01-12"
    },

    {
      "title": "Sunrise On the Reaping",
      "author": "Suzanne Collins",
      "wikiLink": "https://www.goodreads.com/book/show/214331246-sunrise-on-the-reaping?ref=nav_sb_ss_1_22",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/2/20/Sunrise_on_the_Reaping_book_cover.jpg",
      "altText": "Purple background with white text with a gold snake and bird converging",
      "text": "Sunrise on the Reaping explores the 50th Hunger Games, providing deeper insight into Haymitch Abernathy's character and the political complexities of Panem during that era.",
      "genre": "Fiction",
      "format": "Physical",
      "dateRead": "2025-05-3"
    },

    {
      "title": "Dune",
      "author": "Frank Herbert",
      "wikiLink": "https://www.goodreads.com/book/show/44767458-dune?from_search=true&from_srp=true&qid=hUBFSeR8C6&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/d/de/Dune-Frank_Herbert_%281965%29_First_edition.jpg",
      "altText": "Faded brown mountains with a blue sky near the top with title written in a fancy white text",
      "text": "set in a far-future interstellar empire where noble houses vie for control of the desert planet Arrakis—the only source of the powerful spice melange. The story follows young Paul Atreides, heir to House Atreides, as his family is betrayed and he is thrust into exile among the native Fremen. As he adapts to the harsh desert environment, Paul discovers his destiny may be far greater than political revenge",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-04-28"
    },

    {
      "title": "Dune Messiah",
      "author": "Frank Herbert",
      "wikiLink": "https://www.goodreads.com/book/show/44492285-dune-messiah?from_search=true&from_srp=true&qid=qaxgP4AiqQ&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/4/46/Dune_Messiah-Frank_Herbert_%281969%29_First_edition.jpg",
      "altText": "reddish orange background with a skull in the center and white text displayed above with the title",
      "text": "Set twelve years after the events of Dune. Paul Atreides, now Emperor of the known universe, struggles with the consequences of the jihad waged in his name. As political conspiracies threaten his reign, Paul faces moral dilemmas, prophetic burdens, and the limits of prescience. The novel explores themes of power, religion, and the cost of destiny as Paul begins to understand the price of being a messianic figure",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-05-5"
    },

    {
      "title": "Fourth Wing",
      "author": "Rebecca Yarros",
      "wikiLink": "https://www.goodreads.com/book/show/61431922-fourth-wing?ref=nav_sb_ss_1_11",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/d/dd/Fourth_Wing_Cover_Art.jpeg",
      "altText": "Yellow to orange gradient with a black circle and a bird on top of it. ",
      "text": "Follows Violet Sorrengail, a young woman who is unexpectedly forced to join a brutal war college for dragon riders, known as Basgiath War College. Though physically fragile and more suited to a scholarly life, Violet must endure deadly training, form bonds with dragons, and navigate dangerous political intrigue. The story blends romance, action, and high-stakes fantasy, and has been praised for its strong female lead, fast-paced plot, and emotional depth.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-02-25"
    },

    {
      "title": "Iron Flame",
      "author": "Rebecca Yarros",
      "wikiLink": "https://www.goodreads.com/book/show/90202302-iron-flame?ref=nav_sb_ss_1_4",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/1/10/Iron_Flame_Cover_Art.jpg",
      "altText": "Orange to black gradient with a black circle thats being engulfed by flames",
      "text": " series. It continues the story of Violet Sorrengail as she returns to Basgiath War College after surviving the deadly first year and uncovering shocking secrets about her kingdom and the rebellion. In Iron Flame, Violet faces even harsher trials, growing powers, and deeper betrayals—all while her bond with her dragons and her complicated relationship with Xaden Riorson are tested.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-03-15"
    },

    {
      "title": "A Game of Thrones",
      "author": "George R. R. Martin",
      "wikiLink": "https://www.goodreads.com/book/show/13496.A_Game_of_Thrones?ref=nav_sb_ss_1_13",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/9/93/AGameOfThrones.jpg",
      "altText": "Faded yellow and orange text with a lion depicted in the middle",
      "text": "The story follows several noble families—chief among them the Starks, Lannisters, and Targaryens—as they scheme, battle, and form uneasy alliances in their pursuit of power and the Iron Throne. At the heart of the novel is Eddard Stark, a noble and honorable lord who is thrust into the dangerous politics of the royal court when he becomes the King’s Hand. As tensions rise across the realm, ancient supernatural forces begin to stir in the far North beyond the Wall, threatening all of humanity. With its sprawling cast, moral complexity, and dramatic twists, A Game of Thrones lays the foundation for a gripping tale of loyalty, betrayal, and the high cost of power.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-01-16"
    },

    {
      "title": "A Clash of Kings",
      "author": "George R. R. Martin",
      "wikiLink": "https://www.goodreads.com/book/show/10572.A_Clash_of_Kings?from_search=true&from_srp=true&qid=vfTA1O0C2G&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/3/39/AClashOfKings.jpg",
      "altText": "Faded yellow and orange background with a gold crown depicted in the center",
      "text": "Continuing the sweeping saga of political ambition, war, and supernatural threat in the Seven Kingdoms of Westeros. Following the death of King Robert Baratheon, the realm descends into chaos as five kings—Stannis and Renly Baratheon, Robb Stark, Balon Greyjoy, and the boy-king Joffrey Baratheon—vie for the Iron Throne or independence. As civil war erupts across the land, power shifts rapidly, alliances are tested, and betrayal is rampant. Meanwhile, far to the east, Daenerys Targaryen struggles to find allies and strength for her claim to the throne, while in the North, Jon Snow ventures beyond the Wall with the Night’s Watch and discovers ancient, dark forces awakening. A Clash of Kings deepens the complexity of the series with new characters, larger battles, and a growing sense that magic—and danger—is returning to the world.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-01-30"
    },

    {
      "title": "A Psalm for the Wild-Built",
      "author": "Becky Chambers",
      "wikiLink": "https://www.goodreads.com/book/show/40864002-a-psalm-for-the-wild-built?ref=nav_sb_ss_5_4",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/a/a5/PsalmforWild.jpg",
      "altText": "Green flowers with a brown dirt road going across the page with a robot and monk on carriage on the path ",
      "text": "Set in a hopeful, post-industrial future on the moon Panga, the story follows Dex, a tea monk searching for deeper meaning in life, who unexpectedly meets Mosscap, a sentient robot. Robots in this world gained consciousness centuries ago and peacefully left human society, venturing into the wilderness. Mosscap returns with a simple but profound question: What do people need?",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-02-05"
    },

    {
      "title": "The Love Hypthesis ",
      "author": "Ali Hazelwood",
      "wikiLink": "https://www.goodreads.com/book/show/56732449-the-love-hypothesis?from_search=true&from_srp=true&qid=Kwulqjmnn8&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/f/f3/The_Love_Hypothesis.jpg",
      "altText": "Blue cover with a lab setting background a couple kissing in the forefront",
      "text": "The Love Hypothesis follows the main character Olive in trying to convince her best friend, Anh into thinking that her dating life is going great. In order to convince Anh, she pretends to date her professor, Adam. Olive and Adam try to convince everyone around them they are in love. But while convincing everyone, they forget that their feelings are supposed to be fake. How long will it take for Olive and Adam to realize that they don't want to pretend anymore?",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-01-25"
    },

    {
      "title": "The starless sea",
      "author": "Erin Morgenstern",
      "wikiLink": "https://www.goodreads.com/book/show/43575115-the-starless-sea?ref=nav_sb_ss_1_13",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/6/6e/The_Starless_Sea.jpg",
      "altText": "Black background with gold and silver keys floating in the background",
      "text": "The Starless Sea is a 2019 fantasy novel by Erin Morgenstern, known for its lush, lyrical prose and dreamlike storytelling. The novel follows Zachary Ezra Rawlins, a graduate student who discovers a mysterious book in his university library—one that contains a story from his own childhood. This discovery leads him into a hidden, underground world called the Starless Sea, a vast labyrinth of stories, secret doors, and forgotten myths.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-05-7"
    },

    {
      "title": "Shadow and Bone",
      "author": "Leigh Bardugo",
      "wikiLink": "https://www.goodreads.com/book/show/37834723-shadow-and-bone?from_search=true&from_srp=true&qid=MsYo21FyzP&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/9/98/Shadow_and_Bone_%282012%29-Leigh_Bardugo.jpg",
      "altText": "Grey cover with black and sliver vines along the edges and a castle on the bottom of the cover",
      "text": "t follows Alina Starkov, an orphan and mapmaker in the war-torn land of Ravka, a country split in two by a swath of darkness called the Shadow Fold, where monsters known as volcra prey on humans.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-05-7"
    },

    {
      "title": "The Midnight Library",
      "author": "Matt Haig",
      "wikiLink": "https://www.goodreads.com/book/show/52578297-the-midnight-library?ref=nav_sb_ss_1_10",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/8/87/The_Midnight_Library.jpg",
      "altText": "Starry background with a white house in the middle",
      "text": "The story follows Nora Seed, a woman who, feeling hopeless and full of regret, attempts to take her own life. Instead of dying, she finds herself in the Midnight Library—a mysterious space between life and death where every book on the shelves represents a different version of her life, based on the choices she could have made. Guided by her former school librarian, Mrs. Elm, Nora has the opportunity to try on different lives—lives where she became a glaciologist, a rock star, a wife, an Olympic swimmer—each showing her what could have been. As she navigates these alternate realities, Nora begins to understand the value of her own imperfect life and the beauty of possibilities, even in pain.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-03-15"
    },

    {
      "title": "How to stop time",
      "author": "Matt Haig",
      "wikiLink": "https://www.goodreads.com/book/show/45152372-how-to-stop-time?ref=nav_sb_ss_4_9",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/2/2c/How_to_Stop_Time.jpg",
      "altText": "Blue background with a hourglass in the middle with a rose going through the center ",
      "text": "The story centers on Tom Hazard, a seemingly ordinary man who has a rare condition called anageria—he ages extremely slowly and has been alive for over 400 years. From Shakespearean London to jazz-age Paris to modern-day New York, Tom has lived through centuries, witnessing historic events and meeting famous figures. However, his long life is governed by the secretive Albatross Society, which helps people like him stay hidden—on the condition that they follow strict rules, especially never falling in love. Now living as a history teacher in present-day London, Tom yearns for a normal life and struggles with loneliness, loss, and the emotional toll of outliving everyone he loves.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-03-27"
    },

    {
      "title": "Howls Moving Castle ",
      "author": "Diana Wynne Jones",
      "wikiLink": "https://www.goodreads.com/book/show/6294.Howl_s_Moving_Castle?ref=nav_sb_ss_1_15",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/a/a4/Howl%27s_Moving_Castle_%28Book_Cover%29.jpg",
      "altText": "Features a green fire monster in the  background with a red wizard in the forefront",
      "text": "Set in the magical land of Ingary, the story follows Sophie Hatter, a young woman who is cursed by the Witch of the Waste and transformed into an old woman. Seeking to break the curse, Sophie finds refuge in the mysterious, walking castle of the infamous wizard Howl, who is rumored to steal young girls' hearts.Inside the castle, Sophie meets a cast of quirky characters including Calcifer, a fire demon who powers the castle and is bound to Howl by a secret contract, and Michael, Howl’s young apprentice. As Sophie uncovers more about Howl’s true nature and the magical world around her, she becomes entangled in a battle involving curses, war, and identity. Through courage and compassion, she finds strength in herself and challenges the fate imposed on her.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-02-10"
    },

    {
      "title": "People We Meet On Vacation",
      "author": "Emily Henry",
      "wikiLink": "https://www.goodreads.com/book/show/54985743-people-we-meet-on-vacation?ref=nav_sb_ss_1_9",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/2/20/People_We_Meet_on_Vacation.jpg",
      "altText": "Orange background with a man and a women sitting on lounge chairs with a couple palm trees in the background",
      "text": "Explores friendship, love, and the complexities of personal growth. The story centers on Poppy and Alex, two opposites-attract best friends who have taken a summer trip together every year for a decade—until something happened two years ago that drove them apart. Now, in an attempt to fix their friendship, Poppy convinces Alex to take one last vacation together. As they revisit old memories and navigate their unresolved tension, the story alternates between past and present, slowly revealing what went wrong and whether they might be more than just friends.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-01-01"
    },

    {
      "title": "Book Lovers",
      "author": "Emily Henry",
      "wikiLink": "https://www.goodreads.com/book/show/58690308-book-lovers?from_search=true&from_srp=true&qid=QTKdSQzYg2&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/0/07/Book_Lovers.jpg",
      "altText": "A blue background with a man and a women sitting away from each other reading a book",
      "text": "The book follows Nora Stephens, a sharp, ambitious literary agent from New York City who thrives in the fast-paced world of publishing. She’s the “career-focused woman” from every small-town romance—except this time, she’s the protagonist. When Nora agrees to take a vacation to the small town of Sunshine Falls with her sister Libby, she hopes for a relaxing break. Instead, she keeps running into Charlie Lastra, a grumpy editor from back home with whom she has a prickly history. As they’re forced to spend time together, the tension between them turns into something much deeper. Along the way, Nora also confronts her own fears about love, sacrifice, and what it means to choose happiness.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-05-06"
    },

    {
      "title": "Strange The Dreamer",
      "author": "Laini Taylor",
      "wikiLink": "https://www.goodreads.com/book/show/28449207-strange-the-dreamer?from_search=true&from_srp=true&qid=7MfvNSNmhb&rank=1",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/1/1a/Strange_the_Dreamer.jpg",
      "altText": "Yellow and blue page spilt down the middle with adjacent butterfly's scattered throughout the cover",
      "text": "It tells the story of Lazlo Strange, a quiet, orphaned librarian who has spent his life dreaming of the lost city of Weep, a mysterious place that once had a real name—now forgotten by the world. When a delegation from Weep arrives seeking help to solve a centuries-old problem, Lazlo seizes the chance to finally see the city he’s obsessed over. There, he discovers truths far stranger and more magical than he imagined, including the existence of gods, ghosts, and a girl named Sarai, who haunts his dreams—literally. As Lazlo becomes entwined in a conflict between the humans of Weep and the godspawn who dwell above them, he must confront the limits of his knowledge and the power of compassion, imagination, and love.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-02-15"
    },

    {
      "title": "Muse of Nightmares",
      "author": "Laini Taylor",
      "wikiLink": "https://www.goodreads.com/book/show/25446343-muse-of-nightmares?ref=nav_sb_ss_1_12",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/6/63/MuseofNightmares_cover.jpg",
      "altText": "Purple starry background with a white raven flying across the cover",
      "text": "The story picks up where the first book left off, with Lazlo Strange having discovered his true identity and powers, and Sarai, once a ghostly dreamwalker, now existing in a fragile new form. Together, they must navigate the aftermath of trauma, vengeance, and impossible love in the city of Weep. As tensions between the humans and the godspawn rise, a greater threat from beyond their world begins to emerge—one that could unravel not only Weep’s fragile peace but the fabric of the universe itself. New characters and timelines are introduced, revealing the deeper history of the Mesarthim gods and the suffering they caused across distant lands. At its heart, the novel is about overcoming cycles of violence and hatred through empathy, hope, and healing.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-02-30"
    },


    {
      "title": "Aristotle and Dante Discover the Secrets of the Universe",
      "author": "Benjamin Alire Saenz",
      "wikiLink": "",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/7/72/Aristotle_and_Dante_Discover_the_Secrets_of_the_Universe_cover.jpg",
      "altText": "Red truck on a grassy hill overlooking a starry night sky with the book title written in calligraphy",
      "text": "Follows two Mexican-American teenage boys—Aristotle “Ari” Mendoza and Dante Quintana—as they form an unlikely friendship that slowly deepens into something more. Set in 1980s El Paso, the story explores themes of identity, masculinity, family, cultural heritage, and love. While Ari is quiet and guarded, struggling with anger and his family’s secrets, Dante is open, expressive, and unafraid to challenge norms. Through shared experiences, letters, and emotional growth, the boys confront personal truths and the unspoken connection that binds them.",
      "genre": "Fiction",
      "format": "Audiobook",
      "dateRead": "2025-04-01"
    }

    
  ]
 
 

